:PROPERTIES:
:ID:       adb127ea-0c62-4193-bec9-92f90f549fe8
:mtime:    20230206181510 20220930092304
:ctime:    20220421000026
:END:
#+title: Command-line Interface
#+date: [2022-04-21 Thu 00:00]

[[id:18810b42-f2d3-4e7a-86b1-a61c42a4e735][cli-apps]]
[[id:6a288090-3352-4b6a-89c8-b6b81b3b8766][cli-commands]]

* bash variables

bash doesn't have data types.
bash variable can contain numbers and characters
bash uses the "=" sign to assign a value to a variable.
  no spaces before or after the "=" sign.
  varName=value
bash uses "$" to access the variable
  $varName
  wrapping the variable name with curly brackets, is considered good practice

#+begin_src bash
#!/usr/bin/env bash
varName="String"
echo $varName
echo ${varName}
#+end_src
#+RESULTS:
| String |
| String |
var="value" how to define a variable
  no spaces before or after equal sign
$var how to call a variable

variable name rules:
+ only letters, numbers, and underscores can be used for variable naming.
+ the first character, cannot begin with a numbers.
+ no spaces in the middle of a variable name.
+ variable names cannot be punctuated.
+ can not use bash keywords

readonly command can define a variable as a read-only variable, whose value
cannot be changed.
readonly variable

unset command can delete variable
unset variable

read command input to variable
read variable

* unsorted

#+begin_src bash
#!/usr/bin/env bash
echo "hello world"
#+end_src
#+RESULTS:
: hello world

string is enclosed in single quotes.
  printed in its original format.
str='this is a string'

string is enclosed in double quotes.
  printed by its returned value
str="this is a string"

concatenate strings
use double quotes to add two strings
str="$str1 $str2"

string length
"#" use to get the length of the string
#string
echo ${#str}

extract substring
string:start:length
"start': the extraction starts at this index.
"length': the extraction size.
echo ${str:5:10}

`expr`is an expression, which is used for calculation
  enclosed with back quotes
z=`expr $x + $y`

search index
find the index of the first occurrence of a character in a string
`expr index "string" character`
"index" is a parameter, for searching the index of a character.
"character" is a parameter, indicating the character you specify.
echo `expr index "$str" n`
  finds the index of the first occurrence of the "n" character in the string.

pass parameters
$n
"n" represents a number.
"$0" represents the file name.
"$1" represents the first parameter.
"$2" represents the second parameter.

built-in parameters
$0 return the file name
$# return the total number of the parameters
$* return all parameters input by the user
$@ return all parameters input by the user
$$ return the current process ID number of the script
$ ! return the last process ID number of the script
$? returning 0 indicates running successfully

array contain one or more values at a time.
does not support multidimensional arrays
array=(val0 val1 val2)
array[0]=val0
array[1]=val1

accessing the elements
${array[index]}

get all elements
array[@] or array[*] can get all elements of an array.

array length
#array[@] or #array[*] can get the length of an array.

"printf" is a command to format the output
printf "type" variables
"type" is a parameter used to format the output.
%b print it as a binary value
%d print it as a digital value
%f print it as a float-point value
%o print it as an octal value
%s print it as a string value
%x print it as a hexadecimal value
%10s means formatting as a string with a maximum width of 10 characters
%-10s left aligned, no - sign means right aligned
%8.2f means formatting as float-point value, 8 means 8 integers, 2 means 2
decimal places.
%-8.2f left aligned, no - sign means right aligned
printf "%-10s %-7s %-8s\n" Name Age Weight
"%-10s" is replaced by "Name", "Name" is formatted as a string with maximum 10
characters, left aligned.
"\n" is used to go to the next line.

escape sequences
"\" used to escape characters
\a outputs an alert
\n outputs the content to the next new line.
\r makes a return
\t makes a tab
\f outputs the content to the next page.
\' outputs a single quotation mark.
\" outputs a double quotation mark.

operators: arithmetic, relational, boolean, string, file

if..then..else..fi
if condition
then
  if true run this code1
else
  if false run this code2

arithmetical operators
"+" add
"-" subtract
"\*" multiply
"/" divide
"%" get modulus
"==" assignement
"==="" check equality
"!=" check inequality

comparison operators: returns true or false
-eq equal
-ne not equal
-gt greater than
-ge greater or equal
-lt less than
-le less or equal

boolean operators: returns true or false
-a and
-o or
! not

string operators
= if two strings are equal, returns true.
!= if two strings are not equal, returns true.
-z if the length of a string is equal to zero, returns true.
-n if the length of a string is not equal to zero, return true.
$ if the string is not empty, returns true.

file operators are used to detect various properties of linux files.
-d file if the object is a directory, return true.
-f file if the object is a file, return true.
-p file if the object is a pipe, return true.
-r file if the object is a readable file, return true.
-w file if the object is a writable file, return true.
-x file if the object is a executable file, return true.
-e file if the object is a empty file, return true.
-s file if the object isn't empty file, return true.
-b file if the object is a block device file, return true.
-c file if the object is a character device file, return true.

echo command is used to output contents.
-e turn on the escape switch
echo "test line" > testFile # ">" redirect to
echo Today is `date`

test command checks to see if a condition is true.
  tests: numerics, characters and files.
test numerics / characters / files

"[]" is used to execute the arithmetical calculation.
z=[1+2]

test command can be used to test equality of strings
test $str1 = $str2

test command can be used to test whether a file is existing.
  -e
test -e /root/theFile.sh

test command can be used to test empty string
  -n
test -n "$myString"

a function is a code block that can be used repeatedly
funcName(){ #define a function
  code block
}
funcName # call the function

function arguments
myFunc(){
  echo "parameter: ${1}"
  echo "parameter: ${2}"
  echo "parameter: ${3}"
}
myFunc one two three

return command used to return value to the $?.
  $? shows the return value.
add(){
  x=1
  y=2
  z=`expr $x + $y`
  return $z
}
add
echo "sum: $?"

if..then..elif..then..else
elif means else if
if condition1
then
  code1
elif condition2
then
  code2
else
  code3
fi

for loop
for var in item1 item2 item3...
do
  code1
  code2
  ...
done

for var in 1 2 3
do
  echo "$var"
done

while loop
while condition
do
  code
done

counter=1
while(( $counter<=4 ))
do
  echo $counter
  counter=`expr $counter + 1`
done

until loop
until condition
do
  code
done

n=0
until [ $n -ge 4]
do
  echo $n
  n=`expr $n +1`
done

case statement is a multi-select commend.
it matches a value to a pattern
case value in
pattern1) code1;;
pattern2) code2;;
pattern*) code3;; #when match nothing, run this.
esac

echo 'pick number:'
read num
case $num in
  1) echo "you picked 1";;
  2) echo "you picked 2";;
  3) echo "you picked 3";;
  *) echo "you picked more then 3"
esac

break keyword: stop the running of a loop according to condition.
num=0
while(($num<=8))
do
if [$num == 3]
then
break #quit the loop
fi
num=`expr $num + 1`
echo $num
done

continue: stop current iteration, ignoring the following code, and then continue
the next loop.
nums="1 2 3 4 5"
for n in $nums
do
if [$n eq 3]
then
continue #run the next for loop
fi
echo $n
done

select: select one item to meet the condition, and run the related code.
  select usually works with case
select var in item1 item2 item3...
do
  case statement
done

echo "pick num between 1 and 4."
echo "4 will exit program"
select choice in 1 2 3 4;
do
  case $choice in
    1) echo "you choose 1";;
    2) echo "you choose 2";;
    3) echo "you choose 3";;
    4) echo "you choose 4 to exit"
        break;;
    *) echo "enter error!"
        break;;
  esac
done

i/o redirection
linux shell system commands take input from your terminal and send the resulting
output back to your terminal.
a command usually reads data from standard input, and writes data to standard
output.
command > file redirect output to the file.
command < file redirect input to the file.
command >> file append output to the file.
n > file redirect file n to the file
n >> file append file n to the file
n >& m combine the output file m and file n
n <& m combine the input file m and file n
<< tag take the content between tags as input.
file n, file m means the file with file descriptor 0, 1 or 2.
0 means Standard Input. (STDIN).
1 means Standard Output. (STDOUT).
2 means Standard Error. (STDERR).

ssh: Secure SHell
openssh
creates an encypted terminal connection via TCP/IP: typically to port 22
PuTTY: to ssh session with linux systems.

attach an option
options modify the behavior of commands
# Bash

`#!/bin/bash` header
`#!` called shebang

interactive mode
  wait for your command before executing them
  each command you pass it is executed
  while the command being executed you cant interact with bash
  after the command is executed bash wait for you command again
non-interactive mode
  bash can execute scripts
  scripts are pre-written series of commands
# Shell Scripting

shell?
script?
  string of commands run sequentially

one-liners?
  simplest form of scripting
  commands separated by a semicolon
    date; df; whomi
  http://www.bashoneliners.com

script files
  a file that contains our string of commands
  script file is executed > commands string is executed
  proper script file format
    always start with the sha-bang #!
      # stands for hash
      ! stands for bang
    follow by /bin/bash or /bin/sh or /bin/zsh
    # used for comments
    just add commands
      separate commands with semicolon or newline
  run script
    make script executable
      chmod u+x script.sh
      chmod x script.sh
    execute script
      ./script.sh
      copy/move script to directory in $PATH
      modify $PATH to include script directory
      create a symbolic link from script to directory in $PATH
        ln -s script.sh /usr/bin/script.sh

variables?
  A container to hold static or dynamic values
  Environmental variables
    $PATH
    $USER
    $HOME
    $UID
    printenv shows environment variables
  
  User Created variables
    string
      var1=string
      echo $var1
    multiple strings
      var1="my strings"
      echo $var1
    integers
      var1=22
      echo $var1
    variables
      var1=22
      var2=$var1
      echo $var2
    output of a command (command substitution)
      var1=$(date)
    
    Commands substitution
      variable contains output of a command
      backticks
        var1=`date`
      $()
        var1=$(date)
        this is the suggested method
        backticks look too much like single-quotes
    
    Subshells
      "child" shell
      doesn't have access to variables from parent shell

redirection
output/input redirection
  "feeding"
    output redirection
      feed command output to file
      command > file
      date > test11
    input redirection
      feed input to a command
        from a file
          command < file
        from command line (input inline redirection)
          command << inline input redirection
            wc << EOF (EOF is called a text marker)
    piping
      another form of input redirection
      uses the output of one command as the input of the next
      command1 | command2

arithmetic
expr
  man expr
  conflicts with bash special characters
    some expr operators needs to be escaped
$[]
  var1=$[1 + 2]
  var2=$[2 + 5]
  var3=$[$var1 + $var2]
  only support integer arithmetic
bc (bash calculator)
  Programming language that does math
    Can create variables/arrays/functions
    Has conditional logic (if-then)
    Performs floating-point arithmetic
        + What about those `bc` variables?
          - You can only use them inside the `bc` portion of the script.
          - The `bash` shell script can't see/use them.

echo $?
"#" used for shell comments
shell comments are ignore by shell interpreter
":<<EOF comments EOF" used for multi-line comments.

variable
var="value" define a variable
  no space before or after the equal sign
$var call a variable
variable naming rule
  only letters, numbers, and underscores
  first character cannot begin with a number
  no spaces
  no punctuated
  no bash keywords
readonly command can define a variable as a read-only variable, whose
value cannot be changed.
readonly variable
after a variable become readonly, any changes in the value will cause an
error
unset command can delete variables
unset variable
read command take a input as variable
read variable

string
string is enclosed in single quotes.
  will be printed in its original format.
  string variable in the single quotes are invalid.
string is enclosed in double quotes.
  will be printed by its returned value.
  string variable in the double quotes are valid.
connect strings
  str1="connect"
  str2="strings"
  myString="$str1 $str2"
string length; #string
  str="string length"
  echo ${#str} #get the length of the string
extract substring; string:start:length
  start: the extraction starts at this index.
  length: the extraction size
  echo ${str:2:5}
<!--ID: 1639528993617-->


`expr...` is an expression, which is used for calculation
search index; `expr index "string" character`
  index: is a parameter, for searching the index of a character.
  character: is a parameter, indicating the character you specify.
  echo `expr index "$str" n`
    finds the index of the first occurrence of the "n" character in the
    string.

parameters $n
n represents a number
$0 represents the file name.
$1 represents the first parameter.
$2 represents the second parameter.
echo "$0"
echo "$1"
echo "$2"

built-in parameters
$0 return the file name
$# return the total number of the parameter
$* return all parameters input by the user
$@ return all parameters input by the user
$$ return the current process ID number of the script
$ ! return the last process ID number of the script
$? return 0 indicates running successfully

array arr=(value0 value1)
array can contain one or more values at a time.
Bash only support one-dimensional arrays
Bash does not support multidimensional arrays
Bash does not limit the size of arrays
accessing the elements ${arr[index]}
get all elements arr[@] or arr[*]
array length #arr[@] or #arr[*]
<!--ID: 1639528993630-->


printf is a command to format the output in the shell.
printf "type" variables
type is a parameter used to format the output.
%b print it as a binary value
%d print it as a digital value
%f print it as a float-point value
%o print it as an octal value
%s print it as a string value
%x print it as a hexadecimal value
